  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/more-sites/build` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/3e4599e2-afad-4fce-968c-cee0edb98944/terraform-bin plan -no-color -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

# module.eastus["eastus"].azurerm_subnet.gateway will be updated in-place
~ resource "azurerm_subnet" "gateway" {
    ~ address_prefixes                               = [
        - "10.0.0.0/28",
        + "10.0.0.0/27",
      ]
      id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus/subnets/GatewaySubnet"
      name                                           = "GatewaySubnet"
      # (6 unchanged attributes hidden)
  }

# module.eastus["eastus"].azurerm_virtual_network_gateway.gateway will be created
+ resource "azurerm_virtual_network_gateway" "gateway" {
    + active_active       = (known after apply)
    + enable_bgp          = false
    + generation          = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "azure-eastus-vgw"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku                 = "VpnGw2AZ"
    + type                = "Vpn"
    + vpn_type            = "RouteBased"

    + bgp_settings {
        + asn         = (known after apply)
        + peer_weight = (known after apply)

        + peering_addresses {
            + apipa_addresses       = (known after apply)
            + default_addresses     = (known after apply)
            + ip_configuration_name = (known after apply)
            + tunnel_ip_addresses   = (known after apply)
          }
      }

    + ip_configuration {
        + name                          = "vnetGatewayConfig"
        + private_ip_address_allocation = "Dynamic"
        + public_ip_address_id          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/azure-eastus-vgw-pip"
        + subnet_id                     = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus/subnets/GatewaySubnet"
      }
  }

# module.eastus["westus"].azurerm_public_ip.gateway will be created
+ resource "azurerm_public_ip" "gateway" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 15
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus"
    + name                    = "azure-westus-vgw-pip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.eastus["westus"].azurerm_subnet.gateway will be updated in-place
~ resource "azurerm_subnet" "gateway" {
    ~ address_prefixes                               = [
        - "10.1.0.0/28",
        + "10.1.0.0/27",
      ]
      id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus/subnets/GatewaySubnet"
      name                                           = "GatewaySubnet"
      # (6 unchanged attributes hidden)
  }

# module.eastus["westus"].azurerm_virtual_network_gateway.gateway will be created
+ resource "azurerm_virtual_network_gateway" "gateway" {
    + active_active       = (known after apply)
    + enable_bgp          = false
    + generation          = (known after apply)
    + id                  = (known after apply)
    + location            = "westus"
    + name                = "azure-westus-vgw"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku                 = "VpnGw2AZ"
    + type                = "Vpn"
    + vpn_type            = "RouteBased"

    + bgp_settings {
        + asn         = (known after apply)
        + peer_weight = (known after apply)

        + peering_addresses {
            + apipa_addresses       = (known after apply)
            + default_addresses     = (known after apply)
            + ip_configuration_name = (known after apply)
            + tunnel_ip_addresses   = (known after apply)
          }
      }

    + ip_configuration {
        + name                          = "vnetGatewayConfig"
        + private_ip_address_allocation = "Dynamic"
        + public_ip_address_id          = (known after apply)
        + subnet_id                     = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus/subnets/GatewaySubnet"
      }
  }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>